import { Room } from '@/types/room';
export const rooms: Room[] = [
	{
		id: 1,
		title: '숫자 패턴의 비밀',
		question:
			'다음 숫자들의 규칙을 찾아 빈칸에 들어갈 숫자를 맞혀보세요.\n2 → 4\n3 → 9\n4 → 16\n5 → ? \n빈칸에 들어갈 숫자는 무엇일까요?',
		answer: '25',
		hint: '각 숫자를 제곱해 보세요.',
		type: '패턴 숫자 추리',
		difficulty: 4,
	},
	{
		id: 2,
		title: '도둑 찾기',
		question:
			"세 명의 용의자 A, B, C가 있습니다. 한 명은 도둑이고, 나머지 두 명은 진실을 말합니다. A는 'B가 도둑이다'라고 말했고, B는 'C가 도둑이다'라고 말했고, C는 '나는 도둑이 아니다'라고 말했습니다. 누가 도둑일까요?",
		answer: 'B',
		hint: '진실을 말하는 사람의 진술은 모두 일치해야 합니다.',
		type: '추리',
		difficulty: 6,
	},
	{
		id: 3,
		title: '기묘한 시계',
		question:
			"당신은 어느 낡은 방 안에서 오래된 시계를 발견했습니다. 이 시계는 특이하게도 90분마다 한 번씩 '똑' 소리를 냅니다.\n당신이 방에 들어왔을 때, 시계가 막 '똑' 하고 울렸고, 이후 4번의 소리를 더 들었습니다. 현재 시간이 몇 시인지 알아내려면 어떻게 해야 할까요?\n참고로, 당신이 방에 들어온 시간은 오후 3시 정각입니다.",
		answer: '9시',
		hint: '총 4번의 90분이 지났다는 뜻입니다.',
		type: '시간 퍼즐',
		difficulty: 6,
	},
	{
		id: 4,
		title: '사탕 게임',
		question:
			'A, B 두 사람이 사탕 게임을 합니다. 10개의 사탕이 있고, 각자 번갈아 가면서 1개 또는 2개의 사탕을 가져갈 수 있습니다. 마지막 사탕을 가져가는 사람이 지는 게임입니다. A가 먼저 시작했을 때, A가 반드시 이기기 위한 첫 번째 선택은 무엇일까요?',
		answer: '1개',
		hint: '마지막에 2개 또는 3개의 사탕이 남았을 때를 생각해보세요.',
		type: '추리',
		difficulty: 4,
	},
	{
		id: 5,
		title: '가짜 동전',
		question:
			'12개의 동전이 있습니다. 이 중 1개는 가짜 동전이고, 진짜 동전과 무게가 다릅니다. 양팔 저울을 사용하여 최소 횟수로 가짜 동전을 찾아낼 수 있을까요?',
		answer: '3번',
		hint: '동전을 세 그룹으로 나누어 비교해보세요.',
		type: '추리',
		difficulty: 9,
	},
	{
		id: 6,
		title: '자리 맞추기 퍼즐',
		question:
			'A, B, C, D 네 명이 테이블에 둥그렇게 앉았습니다. 조건을 보고 각 사람이 어디에 앉았는지 맞춰보세요.\n\n조건 1) A는 B의 왼쪽에 앉아 있다.\n조건 2) C는 D의 오른쪽에 앉아 있다.\n조건 3) D는 A의 정면에 앉아 있다.\n\nD 다음의 자리는 누? (시계방향 순서로 적어주세요)',
		answer: 'C',
		hint: 'A와 D가 마주보고 있고, A는 B의 왼쪽에 있어야 합니다. 나머지를 채워보세요.',
		type: '표기록/조건 대입형',
		difficulty: 5,
	},
	{
		id: 7,
		title: '숨은 도형 찾기',
		question: '총 몇 개의 도형이 있을까요?',
		answer: '9개',
		hint: '겹쳐진 부분도 각각 하나씩 셉니다. 겹침에 의해 생긴 내부 조각: 3개',
		type: '시각 추리 / 공간 추론',
		difficulty: 7,
	},
	{
		id: 8,
		title: '숫자 속 규칙',
		question:
			'다음 수열에서 물음표(?)에 들어갈 숫자는 무엇일까요?\n\n3 → 5\n5 → 8\n7 → 11\n9 → ?',
		answer: '15',
		hint: '꼭 정수만 곱하는게 답은 아닙니다. ',
		type: '수추리 퍼즐',
		difficulty: 8,
	},
	{
		id: 9,
		title: '비밀번호를 찾아라',
		question:
			'금고를 열기 위해서는 4자리 비밀번호가 필요합니다. \n조건 1) 네 자리 숫자는 모두 다르다.\n조건 2) 첫 번째 숫자는 5보다 작고, 세 번째 숫자는 2배 했을 때 첫 번째 숫자보다 크다.\n조건 3) 네 숫자의 합은 19이다.\n조건 4) 두 번째 숫자와 네 번째 숫자는 각각 홀수이다.\n조건 5) 세 번째 숫자는 네 번째 숫자보다 작다.\n금고의 비밀번호는 무엇일까요?',
		answer: '3745',
		hint: '각 조건을 표로 정리하고 하나씩 대입해보세요. 숫자의 합과 짝수/홀수 조건이 핵심입니다.',
		type: '조건 대입 추리 퍼즐',
		difficulty: 9,
	},
	{
		id: 10,
		title: '스님의 만두 분배',
		question:
			'절에 만두 100개가 있고, 스님 100명이 있습니다.\n\n- 큰스님은 1명이 만두 3개를 먹습니다.\n- 작은스님은 3명이 만두 1개를 나눠 먹습니다.\n\n스님은 오직 두 종류(큰스님, 작은스님)이며 모두 만두를 정확히 먹었습니다.\n\n스님 100명과 만두 100개를 모두 만족하게 하려면, 큰스님과 작은스님은 각각 몇 명일까요(작성예: 10,20)?',
		answer: '25,75',
		hint: '큰스님 1명이 3개를 먹고, 작은스님 3명이 1개를 나눠 먹습니다. 수식을 세워보세요!',
		type: '조건 대입 수학 퍼즐',
		difficulty: 8,
	},
];
